In [1]:
import pandas as pd

### OVERVIEW

In [2]:
# create dataframe

rounds = ['first', 'second', 'third', 'forth', 'fifth', 'sixth']
vals = [1,2,3,4,5,6]
whos = ['teamA', 'teamB', 'teamC', 'teamD', 'teamE', 'teamF']

df_dict = {'Rounds': rounds, 'Vals': vals, 'Teams': whos}

df = pd.DataFrame(df_dict)

In [3]:
# add a new column
df['w_test'] = [9,7,6,4,3,2]

In [4]:
# remove the column
df.drop('w_test', axis=1, inplace=True)

In [5]:
# add some new data

rounds = ['seventh', 'eighth', 'nineth', 'tenth']
vals = [7,8,9,10]
whos = ['teamG', 'teamH', 'teamI', 'teamJ']

df_dict_add = {'Rounds': rounds, 'Vals': vals, 'Teams': whos}


df = pd.concat([df, pd.DataFrame(df_dict_add)], sort=False)

In [6]:
df

    Rounds  Vals  Teams
0    first     1  teamA
1   second     2  teamB
2    third     3  teamC
3    forth     4  teamD
4    fifth     5  teamE
5    sixth     6  teamF
0  seventh     7  teamG
1   eighth     8  teamH
2   nineth     9  teamI
3    tenth    10  teamJ

In [7]:
# notice above the indexes are unchanged
# each dataframe had it own indexes and those are now repeated

# for solving this it is necessary reseting the index

In [8]:
df = df.reset_index(drop=True)

In [9]:
df

    Rounds  Vals  Teams
0    first     1  teamA
1   second     2  teamB
2    third     3  teamC
3    forth     4  teamD
4    fifth     5  teamE
5    sixth     6  teamF
6  seventh     7  teamG
7   eighth     8  teamH
8   nineth     9  teamI
9    tenth    10  teamJ

### SELECTING

In [10]:
df['Rounds']

0      first
1     second
2      third
3      forth
4      fifth
5      sixth
6    seventh
7     eighth
8     nineth
9      tenth
Name: Rounds, dtype: object

In [11]:
df[2:6]

  Rounds  Vals  Teams
2  third     3  teamC
3  forth     4  teamD
4  fifth     5  teamE
5  sixth     6  teamF

In [12]:
# USING loc

In [15]:
df.loc[0:4:2]

  Rounds  Vals  Teams
0  first     1  teamA
2  third     3  teamC
4  fifth     5  teamE

In [14]:
df.loc[[0,1,2]]

   Rounds  Vals  Teams
0   first     1  teamA
1  second     2  teamB
2   third     3  teamC

In [22]:
dd = df.set_index(['Teams'], drop=True)

In [26]:
dd

        Rounds  Vals
Teams
teamA    first     1
teamB   second     2
teamC    third     3
teamD    forth     4
teamE    fifth     5
teamF    sixth     6
teamG  seventh     7
teamH   eighth     8
teamI   nineth     9
teamJ    tenth    10

In [30]:
dd.loc['teamA':'teamH':2]

        Rounds  Vals
Teams
teamA    first     1
teamC    third     3
teamE    fifth     5
teamG  seventh     7

In [39]:
dd.iloc[0:8]

        Rounds  Vals
Teams
teamA    first     1
teamB   second     2
teamC    third     3
teamD    forth     4
teamE    fifth     5
teamF    sixth     6
teamG  seventh     7
teamH   eighth     8

### SELECTING ON GROUP

In [40]:
# add some new data

rounds = ['eleven', 'twelve', 'thirteen', 'forteen', 'fifteen', 'sixteen', 'seventeen', 'eighteen', 'nineteen', 'twenty']
vals = [1,2,3,4,5,6,7,8,9,10]
whos = ['teamA', 'teamB', 'teamC', 'teamD','teamE', 'teamF', 'teamG', 'teamH','teamI', 'teamJ']

df_dict_add2 = {'Rounds': rounds, 'Vals': vals, 'Teams': whos}

df = pd.concat([df, pd.DataFrame(df_dict_add2)], sort=False)

In [43]:
df = df.reset_index(drop=True)

In [49]:
# groping on teams

xx = df.groupby(['Teams']).sum().iloc[1:5:1]

C:\Users\gilma\AppData\Local\Temp\ipykernel_16160\1183007553.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  xx = df.groupby(['Teams']).sum().iloc[1:5:1]

In [50]:
xx

       Vals
Teams
teamB     4
teamC     6
teamD     8
teamE    10

### SELECTING ON CONTENT

In [55]:
df.loc[(df['Teams']=='teamA') | (df['Teams']=='teamB')]

    Rounds  Vals  Teams
0    first     1  teamA
1   second     2  teamB
10  eleven     1  teamA
11  twelve     2  teamB

# MANIPULATING DATA